Revit 2024 API
GeometryInstance.GetDocument Method
Gets the document that contains the symbol of this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public Document GetDocument()
Visual Basic
Public Function GetDocument As Document
Visual C++
public:
Document^ GetDocument()
Return Value
Returns the document that contains the symbol of this instance.
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace